<!DOCTYPE html>
<html lang="en">

    <head>
        <?php include_once "\partials\_Head.php"; ?>
    </head>

    <body>
        <?php include_once '\partials\_MainMenu.php'; ?>
        <div class="container">

            <div class="col-md-12 well">
                <h2 class="blue"><strong>Софтуерен университет</strong></h2>
                <section>
                    <div class="col-md-7 some-spacing-text">
                        <p class="aboutText">
                            За нас, както и за цялата софтуерна индустрия, е най-важен <strong>практическият опит</strong>.
                            Нашата мисия е да направим хората, които обучаваме, <strong>
                                истински професионалисти в софтуерната
                                индустрия
                            </strong> и да им съдействаме в <strong>намирането на работа</strong>.
                            <br>
                            <br>
                            Учебният план, по който се провеждат занятията в Софтуерния университет, се състои от няколко нива &ndash;
                            едно подготвително ниво за приемния изпит (2 месеца) и 6 нива обучение по програмиране, технологии
                            и разработка на софтуер (всяко по 4 месеца). Предоставя се възможност за получаване на университетска
                            <strong>диплома за висше образование</strong> от един от нашите университети-партньори след
                            допълнително обучение при тях с продължителност 1 или 2 години.
                        </p>
                    </div>
                </section>
                <div class="col-md-5">
                    <img alt="Generic placeholder image" src="assets/images/softUni-transparent.png" class="img-responsive right center">
                    <!--<div class="linkBelowImage"><a href="#" class="gallery">View full gallery</a></div>-->
                </div>
            </div>

            <ul class="nav nav-tabs" role="tablist" id="myTab">
                <li class="active"><a href="#softuni" role="tab" data-toggle="tab">Софтуерен университет</a></li>
                <li><a href="#fondation" role="tab" data-toggle="tab">Фондация</a></li>
                <li><a href="#plan" role="tab" data-toggle="tab">Учебен план</a></li>
                <li><a href="#exams" role="tab" data-toggle="tab">Изпити</a></li>
            </ul>
            <div class="tab-content">
                <div class="tab-pane fade in active" id="exams">
                    <h2>Приемен изпит</h2>
                    <p>Приемът в Софтуерния университет за онлайн и присъственото обучение се осъществява чрез приемен изпит по програмиране.</p>
                    <p>Приемен изпит ще се провежда на всеки два месеца. Студентите могат да изберат да се запишат за <strong>безплатния подготвителен курс</strong> (Ниво #0, който продължава 8 седмици) или направо да се явят на изпита, ако се чувстват достатъчно подготвени.</p>
                    <p>Изпитът е върху <strong>основи на програмирането</strong> и е с продължителност 6-8 часа. Той включва 5 практически задачи по програмиране. При решаването на всяка задача, студентът качва решението си в онлайн система за автоматизирана проверка и получава почти веднага своя резултат за съответната задача.</p>
                    <p>На приемния изпит може да програмирате на някой от следните езици за програмиране: <strong>C#</strong>, <strong>Java</strong>, <strong>JavaScript</strong>, <strong>C</strong>, <strong>C++</strong> (последни версии). Подготовката за приемния изпит ще бъде с езика C#. Използването на други езици за програмиране е на ваш собствен риск.</p>
                    <h2>Изпити</h2>
                    <p>Изпитите се провеждат присъствено и представляват практическо решаване на задачи или разработка и защита на практически проект.</p>
                    <p>Всички изпити от софтуерния университет се провеждат <strong>присъствено</strong> в учебните зали на софтуерния университет в гр. София, в предварително определени дати и часове. За някои изпити се предоставя възможност за избор между няколко дати. Онлайн изпити не се провеждат поради невъзможност за гарантиране на честността.</p>
                    <p>Явяването на изпит става само по покана от софтуерния университет. При явяване на изпити <strong>се изисква документ за самоличност</strong>. На изпитите е позволено да се ползва Интернет, както и предварително подготвени или публично достъпни в Интернет <strong>помощни материали</strong> (книги, учебници, презентации, видео уроци и други). На изпитите е забранено да се ползва чужда помощ под каквато и да е форма: разговори с колеги, ползване на e-mail, ползване на услуги за прехвърляне на файлове като Dropbox, писане във форуми, Facebook, Skype и използване на чат-програми. За някои изпити се изисква инсталиране и ползване на специализиран софтуер за превенция на непозволена комуникация (<strong>anti-cheat client</strong>), предоставен от софтуерния университет.</p>
                    <p>При установяване на <strong>преписване на изпит</strong> (ползване на ползване на чужда помощ на някои от изпитите или представяне на чудж проект като свой), се <strong>отнемат студентските права</strong> на заловения студент за период от 1 година. В този период студентът няма право да учи в софтуерния университет и не му се възстановяват таксите за обучение за текущото ниво.</p>
                    <h2>Поправки</h2>
                    <p>Ако не успеете да се явите или да вземете изпита си за някой курс, може да се явите повторно на поправка.</p>
                    Няма определена поправителна сесия, но ако студентите не успеят да вземат някой от изпитите си, то те могат <strong>да запишат отново същото ниво</strong> и да се явят само за изпита, които не са взели. При желание, могат да се явят и на другите изпити, ако искат да повишат оценката си.<br>
                </div>
                <div class="tab-pane fade" id="softuni">
                    <h2>“Софтуерен университет” ООД</h2>
                    <p>
                        Нашата цел в Софтуерния университет е да предложим <strong>
                            качествено образование,
                            професия и работа
                        </strong>на нашите студенти. За нас, както и за цялата софтуерна
                        индустрия, е най-важен <strong>практическият опит</strong>. Ето защо за нас основна
                        цел и мисия е да направим хората, които обучаваме, истински професионалисти в
                        софтуерната индустрия и да им съдействаме в намирането на работа. Има опция и за
                        получаване на <strong>университетска диплома</strong> <strong>за висше образование</strong>
                        от един от нашите университети-партньори след допълнително обучение при тях с
                        продължителност 1 или 2 години.
                    </p>
                    <h3>Кой може да се запише?</h3>
                    <p>
                        Няма ограничение по пол или възраст или други ограничения. Всеки, които има интерес и желание,
                        може да се запише след успешно покриване на приемния изпит.
                    </p>
                    <p>
                        Ние, в Софтуерния университет, вярваме в <strong>ученето през целия живот</strong>.
                        Ето защо няма ограничение за възрастта на кандидат-студентите. Ако те преминат успешно
                        приемния изпит, могат да се запишат за ниво #1.
                    </p>
                    <p>Право на обучение по стипендия от софтуерния университет имат лица, които са навършили 17 години.</p>
                    <p>
                        Право на обучение като студенти в партньорските ВУЗ-ове (за висше образование) имат само лица,
                        които са <strong>завършили средно образование</strong> или предстои да го завършат в настоящата
                        календарна година.
                    </p>
                    <p>
                        Изисква се владеене на <strong>български и английски език</strong> на средно ниво и начална
                        компютърна грамотност. Ако се чудите дали английския ви език е на достатъчно добро ниво, за да
                        се обучавате в софтуерния университет, разгледайте учебните материали от курса
                        <a href="/courses/csharp-basics">“<strong>C# основи</strong>”</a> и се уверете,
                        че разбирате английския текст в тях.
                    </p>
                </div>
                <div class="tab-pane fade" id="fondation">
                    <h2>Фондация “Софтуерен университет”</h2>
                    <p>
                        Фондация “Софтуерен университет” разработва, съхранява и разпространява
                        учебни курсове и материали, които се ползват в процеса на обучение в Софтуерния университет.
                    </p>

                    <p>
                        Фондация “Софтуерен университет” е нестопанска организация с идеална цел и работи
                        в обществена полза за подобряване на образованието за софтуерни инженери и ИТ специалисти в България.
                    </p>

                    <h3>Фондацията има следните цели:</h3>
                    <ul>
                        <li>
                            разработка, стопанисване, споделяне и разпространение на учебно съдържание за обучение
                            на софтуерни инженери и специалисти в областта на информационните технологии с използването
                            на публични лицензи;
                        </li>
                        <li>
                            предоставяне на безплатно образование и професионална квалификация за софтуерни инженери
                            и специалисти в областта на информационните технологии;
                        </li>
                        <li>
                            провеждане на курсове, семинари, конференции и обучения с практическа насоченост в
                            областта на компютърните науки, софтуерните технологии и информационните технологии;
                        </li>
                        <li>
                            развитие на отворено образование и култура на споделяне и сътрудничество;
                        </li>
                        <li>
                            подпомагане развитието и усъвършенстването на сектора на информационните технологии,
                            иновациите и високите технологии.
                        </li>
                    </ul>

                    <h3>Още за фондацията</h3>
                    <p>
                        Фондация "Софтуерен университет" се задвижва от доброволци и се финансира от спонсори. Тя
                        организира безплатни обучения по програмиране и софтуерни технологии в цяла България. Научете
                        повече от нейния сайт: <strong><a href="http://softuni.org">softuni.org</a></strong>.
                    </p>
                </div>
                <div class="tab-pane fade" id="plan">
                    <h2>Учебен план и съдържание на курсовете</h2>
                    <p>
                        Учебният план, по който се провеждат занятията в Софтуерния университет, се състои от
                        няколко нива &ndash; едно подготвително ниво за приемния изпит (2 месеца) и 6 нива
                        обучение по програмиране, технологии и разработка на софтуер (всяко по 4 месеца):
                    </p>
                    <table class="table table-bordered k-table">
                        <thead>
                            <tr>
                                <th><strong>Ниво</strong></th>
                                <th><strong>Описание</strong></th>
                                <th><strong>Продължителност</strong></th>
                            </tr>
                        </thead>
                        <tbody>
                            <tr>
                                <td>Ниво #0</td>
                                <td>Подготовка за приемен изпит - основи на програмирането</td>
                                <td>2 месеца</td>
                            </tr>
                            <tr>
                                <td colspan="3">Приемен изпит по практическо програмиране</td>
                            </tr>
                            <tr>
                                <td>Ниво #1</td>
                                <td>Основи на програмирането и уеб технологиите</td>
                                <td>4 месеца интензивно</td>
                            </tr>
                            <tr>
                                <td>Ниво #2</td>
                                <td>Програмиране и ООП / изграждане на уеб сайтове</td>
                                <td>4 месеца интензивно</td>
                            </tr>
                            <tr>
                                <td>Ниво #3</td>
                                <td>Софтуерни технологии / бази данни и уеб разработка / уеб front-end технологии</td>
                                <td>4 месеца интензивно</td>
                            </tr>
                            <tr>
                                <td colspan="3">Препоръчително започване на работа по придобитата <a href="/professions">професия</a></td>
                            </tr>
                            <tr>
                                <td>Ниво #4</td>
                                <td>Алгоритми и софтуерно инженерство</td>
                                <td>4 месеца</td>
                            </tr>
                            <tr>
                                <td>Ниво #5</td>
                                <td>Хардуер и системна администрация</td>
                                <td>4 месеца</td>
                            </tr>
                            <tr>
                                <td>Ниво #6</td>
                                <td>Софтуерни технологии за напреднали и бизнес умения за ИТ специалисти</td>
                                <td>4 месеца</td>
                            </tr>
                            <tr>
                                <td colspan="3">
                                    Придобиване на диплома за <strong>софтуерен инженер-практик</strong>
                                </td>
                            </tr>
                            <tr>
                                <td style="width:70px; vertical-align:middle;">Години 3-4</td>
                                <td>
                                    Допълнително пожелателно обучение в акредитиран ВУЗ по съвместна програма
                                    с цел завършване на висше образование
                                </td>
                                <td>1-2 години (според университета и специалността)</td>
                            </tr>
                        </tbody>
                    </table>

                    <h3>
                        Ниво #0 - подготовка за приемен изпит<br>
                    </h3>
                    <ul>
                        <li>
                            <strong>Цена</strong>: безплатно
                        </li>
                        <li>
                            <strong>Достъп</strong>: навършени 17 години (за присъствено обучение)
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 2 месеца, по 10-20 часа седмично
                        </li>
                    </ul>
                    <p>
                        Обученията стартират с <strong>Ниво #0</strong>, в което се изучават основите на програмирането с курса
                        <a href="/courses/csharp-basics">“<strong>C# основи</strong>”</a>. То представлява
                        <strong>подготовка</strong> за приемния изпит за Софтуерния университет и е <strong>безплатно</strong>.
                        Продължителността му е <strong>около 2 месеца</strong>, веднъж седмично по 4 часа, с много домашни и
                        практически упражнения. Следва <strong>приемен изпит</strong> по програмиране, който се провежда присъствено
                        в София и включва решаване на 5 задачи по програмиране за 6 часа. Оценяването на изпита се извършва с
                        автоматизирана проверка на резултатите в реално време (online judge system).
                    </p>
                    <p>
                        Обучението в това ниво <strong>не е задължително</strong>. Студентите могат да изберат да се явят
                        направо на приемния изпит, ако се чувстват достатъчно подготвени. За целта първо трябва да
                        <a href="/apply">кандидатстват за университета</a> след което ще бъдат записани за курса
                        “<strong>C# основи</strong>” онлайн.
                    </p>
                    <h3>Ниво #1 - основи на програмирането и уеб технологиите</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно преминат приемен изпит
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-12 часа на ден
                        </li>
                    </ul>
                    <p>
                        Следва <strong>Ниво #1</strong>, което включва основи по <strong>програмиране и уеб</strong> с няколко
                        езика и платформи за разработка (Java, PHP, JavaScript). По същество, това е <strong>първият семестър</strong>
                        от обучението, а продължителността е 4 месеца. По време тези <strong>4 месеца</strong> се преподават
                        Java основи, Web основи (HTML &amp; CCS), Java Script основи и PHP основи. Обучението е <strong>доста интензивно</strong>
                        и набляга върху развиването на умения за работа в екип и на личностните умения на студентите. Нивото се завършва
                        с успешно издържани <strong>изпити</strong> по всеки един от включените курсове.
                    </p>

                    <h3>Ниво #2 - програмиране и ООП</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно завършено ниво #1
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-12 часа на ден
                        </li>
                    </ul>
                    <p>
                        <strong>Ниво #2</strong> включва <strong>програмиране и ООП</strong>. Продължителността на това ниво отново
                        <strong>е 4 месеца. </strong>По време на това ниво студентите ще изучават по-задълбочено езика C#,
                        обектно-ориентирано програмиране със C#, JavaScript програмиране, JavaScript приложения, както и
                        качествен програмен код.
                    </p>
                    <p>
                        В бъдеще софтуерният университет ще предлага и други възможности за професионална квалификация в направления
                        “разработчик на мобилни приложения”, “PHP уеб разработчик” и други. Тези специалности
                        ще включват други курсове на ниво #2: Java програмиране и Java ООП, или Android основи и Android приложения,
                        или PHP програмиране и PHP ООП, или Objective C основи и iOS приложения. Нивото се завършва с успешно издържани
                        <strong>изпити</strong> по всеки един от включените в него курсове.
                    </p>

                    <h3>Ниво #3 - софтуерни технологии</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно завършено ниво #2
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-12 часа на ден
                        </li>
                    </ul>
                    <p>
                        <strong>Ниво #3</strong>има за цел усвояването на <strong>софтуерни технологии</strong>, които се използват
                        в практиката при разработка на софтуерни приложения и системи. През <strong>4-те месеца</strong>на това ниво,
                        преподаваните курсове са бази данни, приложения с бази данни, уеб услуги и облачни технологии, основи на уеб
                        разработката и MVC-базирани технологии за уеб разработка. Нивото се завършва с преминаването на
                        <strong>изпит по всеки един</strong> от избраните курсове. Има и един модул, който подготвя студентите за
                        <strong>кандидатсване и интервю за работа</strong>.
                    </p>

                    <p>
                        В бъдеще софтуерният университет ще дава възможност за придобиване на други професии освен
                        “уеб разработчик”, които ще включват изучаване на други курсове, платформи и технологии в ниво #3.
                        Планират се следните курсове: Photoshop, WordPress, SEO и дигитален маркетинг, изграждане на уеб сайтове,
                        Node.js, Single Page Apps, хибридни мобилни приложения, курсове за инженери по качеството на софтуера (QA инженери).
                        Някои от тези курсове изискват разработка и защита на практически проект, а други преминаването на практически изпит.
                    </p>

                    <h3>Ниво #4 - алгоритми и софтуерно инженерство</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно завършено ниво #3
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-20 часа седмично
                        </li>
                    </ul>
                    <p>
                        <strong>Ниво #4</strong> предоставя обучение по <strong>алгоритми и софтуерно инженерство</strong>.
                        Продължителността отново е <strong>4 месеца</strong>. Включват се курсове по структури от данни и алгоритми,
                        софтуерно инженерство, управление на ИТ проекти. Нивото се завършва с <strong>изпит</strong>
                        <strong>по всеки един от избраните курсове</strong>. Ще се предлагат и допълнителни курсове като дизайн
                        на потребитеслки интерфейс и потребителско изживяване (UX), настолни приложения, програмиране на Python и Django,
                        програмиране на Ruby и Rails.
                    </p>

                    <h3>Ниво #5 - хардуер и системна администрация</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно завършено ниво #4
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-20 часа седмично
                        </li>
                    </ul>
                    <p>
                        Следва <strong>Ниво #5</strong>, което включва <strong>хардуер и системна администрация</strong>.
                        Продължителността отново е <strong>4 месеца</strong>. Предлагат се курсове по компютърни мрежи, хардуер
                        (компютърни архитектури) и вградени системи (embedded development). Вместо тях може да се изберат курсове
                        по операционни системи и Linux системна администрация или програмиране на езика C, системно програмиране
                        и програмиране на C++. Нивото се завършва с <strong>разработка и защита на практически проекти</strong>
                        по всеки един от избраните курсове.
                    </p>

                    <h3>Ниво #6 - софтуерни технологии за напреднали и бизнес умения за ИТ специалисти</h3>
                    <ul>
                        <li>
                            <strong>Достъп</strong>: успешно завършено ниво #5
                        </li>
                        <li>
                            <strong>Продължителност</strong>: 4 месеца, по 10-20 часа седмично
                        </li>
                    </ul>
                    <p>
                        Последното ниво е <strong>Ниво #6</strong>, което също е с продължителност от 4 месеца. То е съсредоточено
                        върху <strong>софтуерни технологии за напреднали и бизнес умения за ИТ специалисти</strong>. Възможните
                        курсове за избор са: бизнес умения за софтуерни инженери, компютърна графика, интелигентни системи,
                        информационна сигурност, системи за анализ на данни и бизнес интелигентност (BI) и паралелни алгоритми.
                        Всеки курс приключва с представянето на <strong>проект</strong>.
                    </p>

                    <h2><strong>Интензивност</strong></h2>
                    <p class="intensity-graphics"><img src="/Files/UserFiles/ImageGallery/intensity-levels.PNG" alt="Intensity graphics"></p>
                    <p>
                        Първата година (нива #1, #2 и #3) са много <strong>интензивни</strong>(изискват средно по 10-12 часа на ден за начинаещ
                        в програмирането). Следващите нива са с <strong>ниско натоварване</strong> и са подходящи за работещи.
                    </p>
                </div>
            </div>
        </div>
        <footer>
            <?php include_once "\partials\_Footer.php"; ?>
        </footer>
        <script src="js/jquery-1.10.2.js"></script>
        <script src="js/bootstrap.js"></script>
    </body>
</html>