<!DOCTYPE html>
<html lang="en">

    <head>
        <?php include_once "partials/_Head.php"; ?>
    </head>

    <body>

        <?php include_once 'partials/_MainMenu.php'; ?>

        <div class="container">
            <div class="well">
                <p>Светлин Наков не ползва unit тестове. Той тества методите наум докато програмата се компилира.</p>
            </div>
            <div class="well">
                <p>Картинката на Bing всъщност е wallpaper-а на Светлин Наков в реално време.</p>
            </div>
            <div class="well">
                <p>Веднъж един катаджия имаше неблагоразумието да глоби Светлин Наков за превишена скорост. Още същия ден, Наков му изтри апартамента с SQL injection.</p>
            </div>
            <div class="well">
                <p>MSDN всъщност е записките на Светлин Наков.</p>
            </div>
            <div class="well">
                <p>Светлин Наков използва quicksort когато си подрежда бюрото.</p>
            </div>
            <div class="well">
                <p>Кодът на Светлин Наков не следва конвенциите за КПК. Обратното!</p>
            </div>
            <div class="well">
                <p>Когато търсиш "гуру" в Google, получаваш Светлин Наков като suggestion.</p>
            </div>
            <div class="well">
                <p>Светлин Наков никога не коментира кода си. Защо? За да ви е гадно, разбира се.</p>
            </div>
            <div class="well">
                <p>Когато вика някой от методите на Светлин Наков, компилаторът казва "ако обичаш"</p>
            </div>
            <div class="well">
                <p>Светлин Наков не имплементира IComparable&lt;&gt;. Той не може да бъде сравнен.</p>
            </div>
            <div class="well">
                <p>Светлин Наков не ползва source control. Той помни всички ревизии наизуст.</p>
            </div>
            <div class="well">
                <p>Светлин Наков само веднъж е имал бъг в програмата си. Резултата? Глобалната финансова криза.</p>
            </div>
            <div class="well">
                <p>Светлин Наков не програмира, той светлин-наковства.</p>
            </div>
            <div class="well">
                <p>Когато не успее да компилира кода на Светлин Наков, компилаторът се извинява.</p>
            </div>
            <div class="well">
                <p>Светлин Наков генерира случайни числа в свободното си време.</p>
            </div>
            <div class="well">
                <p>Когато Светлин Наков се логне в уебсайт, сървърният лог пише "HOLY SHIT!!! SVETLIN NAKOV IS HERE!!!"</p>
            </div>
            <div class="well">
                <p>Когато не може да заспи, Светлин Наков брои овце - 1, 2, 3... 9, А, B, C, D, E, F, 10... Когато overflow-не long, обръща и почва отново от -9223372036854775809.</p>
            </div>
            <div class="well">
                <p>Когато няма дребни монети, Светлин Наков хаква кафе автомата с cross site scripting.</p>
            </div>
            <div class="well">
                <p>Светлин Наков веднъж хакна уебсайта на Пентагона по невнимание.</p>
            </div>
            <div class="well">
                <p>Когато Светлин Наков отива онлайн, той не се свързва към Интернет. Интернет се свързва към него.</p>
            </div>
            <div class="well">
                <p>Светлин Наков веднъж се сблъска с програмен проблем който не можеше да реши. След това се събуди.</p>
            </div>
            <div class="well">
                <p>Светлин Наков търси ключовете си с DFS. </p>
            </div>
            <div class="well">
                <p>C# 6.0 е готов, но Microsoft чака позволение от Светлин Наков за да го публикува.</p>
            </div>
            <div class="well">
                <p>Когато няма Visual Studio под ръка, Светлин Наков програмира на C# в двоичен вид. Обикновено кодът върви с 30% по-бързо от компилирания.</p>
            </div>
            <div class="well">
                <p>NSA наблюдава данните на целия свят; Светлин Наков наблюдава данните на NSA.</p>
            </div>
            <div class="well">
                <p>Microsoft искат да преименуват "Cancel" бутона на "Махай се гад мръсна!",но все още чакат позволение от Светлин Наков.</p>
            </div>
        </div>      
        <footer>
            <?php include_once "partials/_Footer.php"; ?>
        </footer>
        <script src="js/jquery-1.10.2.js"></script>
        <script src="js/bootstrap.js"></script>

    </body>

</html>
